In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np
import seaborn as sns
#np.nan-->missing values

In [2]:
df=pd.read_csv("G:/data/h-1b-visa/h1b_kaggle.csv")

In [3]:
df.shape

(3002458, 12)

In [7]:
df.head()

,Unnamed: 0,Unnamed: 0.1,Status,EMPLOYER_NAME,SOC_NAME,JOB_TITLE,FULL_TIME_POSITION,PREVAILING_WAGE,YEAR,WORKSITE,lon,lat
0,0,1,CERTIFIED-WITHDRAWN,UNIVERSITY OF MICHIGAN,BIOCHEMISTS AND BIOPHYSICISTS,POSTDOCTORAL RESEARCH FELLOW,N,36067.0,2016.0,"ANN ARBOR, MICHIGAN",-83.743038,42.280826
1,1,2,CERTIFIED-WITHDRAWN,"GOODMAN NETWORKS, INC.",CHIEF EXECUTIVES,CHIEF OPERATING OFFICER,Y,242674.0,2016.0,"PLANO, TEXAS",-96.698886,33.019843
2,2,3,CERTIFIED-WITHDRAWN,"PORTS AMERICA GROUP, INC.",CHIEF EXECUTIVES,CHIEF PROCESS OFFICER,Y,193066.0,2016.0,"JERSEY CITY, NEW JERSEY",-74.077642,40.728158
3,3,4,CERTIFIED-WITHDRAWN,"GATES CORPORATION, A WHOLLY-OWNED SUBSIDIARY O...",CHIEF EXECUTIVES,"REGIONAL PRESIDEN, AMERICAS",Y,220314.0,2016.0,"DENVER, COLORADO",-104.990251,39.739236
4,4,5,WITHDRAWN,PEABODY INVESTMENTS CORP.,CHIEF EXECUTIVES,PRESIDENT MONGOLIA AND INDIA,Y,157518.4,2016.0,"ST. LOUIS, MISSOURI",-90.199404,38.627003

In [8]:
df.rename({"CASE_STATUS":"Status"},axis=1,inplace=True)

In [9]:
df.head(2)

,Unnamed: 0,Unnamed: 0.1,Status,EMPLOYER_NAME,SOC_NAME,JOB_TITLE,FULL_TIME_POSITION,PREVAILING_WAGE,YEAR,WORKSITE,lon,lat
0,0,1,CERTIFIED-WITHDRAWN,UNIVERSITY OF MICHIGAN,BIOCHEMISTS AND BIOPHYSICISTS,POSTDOCTORAL RESEARCH FELLOW,N,36067.0,2016.0,"ANN ARBOR, MICHIGAN",-83.743038,42.280826
1,1,2,CERTIFIED-WITHDRAWN,"GOODMAN NETWORKS, INC.",CHIEF EXECUTIVES,CHIEF OPERATING OFFICER,Y,242674.0,2016.0,"PLANO, TEXAS",-96.698886,33.019843

In [26]:
#df.to_csv("G:/data/h-1b-visa/second_file",index=True)

In [27]:
columns=["status","company","job","salary",""]

In [28]:
df.head()

   a  b
0  2  6
1  3  4
2  4  2

In [29]:
#df.to_csv("G:\data\h-1b-visa\three.tsv",index=False,sep="\t")

In [3]:
import os
os.getcwd()

'C:\\Users\\hp'

In [4]:
pwd

'C:\\Users\\hp'

In [5]:
os.chdir("..") #-->to go into previous directory

In [6]:
pwd

'C:\\Users'

In [7]:
import pandas as pd
df=pd.DataFrame({"a":[2,3,4],"b":[6,4,2]})

In [8]:
df

   a  b
0  2  6
1  3  4
2  4  2

In [9]:
df1=pd.DataFrame([[4,5,7],[2,3,4],[1,6,7]],columns=["a","b","c"])

In [10]:
df1

   a  b  c
0  4  5  7
1  2  3  4
2  1  6  7

In [11]:
df1=pd.DataFrame([[4,5,7],[2,3,4],[1,6,7]],columns=["a","b","c"],index=[1,2,3])

In [12]:
df1

   a  b  c
1  4  5  7
2  2  3  4
3  1  6  7

In [13]:
df1.melt() # or pd.melt(df)

  variable  value
0        a      4
1        a      2
2        a      1
3        b      5
4        b      3
5        b      6
6        c      7
7        c      4
8        c      7

In [14]:
# df1.pivot(columns="var")

In [15]:
pd.concat([df,df1])

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

   a  b    c
0  2  6  NaN
1  3  4  NaN
2  4  2  NaN
1  4  5  7.0
2  2  3  4.0
3  1  6  7.0

In [17]:
import numpy as np
s=pd.Series(np.random.randint(10,20,50))

In [18]:
s

0     13
1     15
2     11
3     14
4     19
5     16
6     17
7     19
8     18
9     19
10    14
11    11
12    18
13    14
14    10
15    15
16    10
17    17
18    19
19    19
20    19
21    10
22    12
23    10
24    11
25    12
26    16
27    17
28    12
29    10
30    16
31    15
32    14
33    18
34    17
35    18
36    13
37    12
38    16
39    15
40    14
41    14
42    11
43    17
44    19
45    11
46    16
47    12
48    11
49    15
dtype: int32

In [19]:
type(s.value_counts())

pandas.core.series.Series

In [20]:
s.value_counts()

19    7
14    6
11    6
17    5
16    5
15    5
12    5
10    5
18    4
13    2
dtype: int64

In [21]:
df.info

<bound method DataFrame.info of    a  b
0  2  6
1  3  4
2  4  2>

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
a    3 non-null int64
b    3 non-null int64
dtypes: int64(2)
memory usage: 128.0 bytes

In [23]:
student={"name":["ram","hari","jhon","nisha","neha"],
        "marks":[67,75,75,24,95],
        "sex":pd.Categorical(["male","male","male","female","female"])}

In [24]:
student

{'name': ['ram', 'hari', 'jhon', 'nisha', 'neha'],
 'marks': [67, 75, 75, 24, 95],
 'sex': [male, male, male, female, female]
 Categories (2, object): [female, male]}

In [25]:
df2=pd.DataFrame(np.random.randint(1,100,20).reshape(5,4),columns=list("ABCD"),index=pd.date_range("20190601",periods=5))

In [26]:
df2

             A   B   C   D
2019-06-01  40  40  44  63
2019-06-02  63  67  62   9
2019-06-03  54  35  78  51
2019-06-04   2  77  42  67
2019-06-05  28  14   6  59

In [27]:
df2.loc[::2]

             A   B   C   D
2019-06-01  40  40  44  63
2019-06-03  54  35  78  51
2019-06-05  28  14   6  59

In [28]:
pd.date_range("20190304",periods=4)

DatetimeIndex(['2019-03-04', '2019-03-05', '2019-03-06', '2019-03-07'], dtype='datetime64[ns]', freq='D')

In [29]:
df2.sort_values(by=["A","B"],ascending=False)

             A   B   C   D
2019-06-02  63  67  62   9
2019-06-03  54  35  78  51
2019-06-01  40  40  44  63
2019-06-05  28  14   6  59
2019-06-04   2  77  42  67

In [30]:
df3=df2.pivot_table(columns="A")

In [31]:
df3

A  2   28  40  54  63
B  77  14  40  35  67
C  42   6  44  78  62
D  67  59  63  51   9

In [32]:
df2["E"]=np.random.randint(2,30,5)

In [33]:
df2

             A   B   C   D   E
2019-06-01  40  40  44  63   3
2019-06-02  63  67  62   9   4
2019-06-03  54  35  78  51  11
2019-06-04   2  77  42  67  13
2019-06-05  28  14   6  59  13

In [34]:
df3.shape

(3, 5)

In [35]:
df2.shape

(5, 5)

In [36]:
pd.concat([df,df2])#df2.reindex()

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

                        A     B     C     D     E    a    b
0                     NaN   NaN   NaN   NaN   NaN  2.0  6.0
1                     NaN   NaN   NaN   NaN   NaN  3.0  4.0
2                     NaN   NaN   NaN   NaN   NaN  4.0  2.0
2019-06-01 00:00:00  40.0  40.0  44.0  63.0   3.0  NaN  NaN
2019-06-02 00:00:00  63.0  67.0  62.0   9.0   4.0  NaN  NaN
2019-06-03 00:00:00  54.0  35.0  78.0  51.0  11.0  NaN  NaN
2019-06-04 00:00:00   2.0  77.0  42.0  67.0  13.0  NaN  NaN
2019-06-05 00:00:00  28.0  14.0   6.0  59.0  13.0  NaN  NaN

In [37]:
d1=pd.DataFrame({"sid":[231,232,233,234,235],"name":["x","y","z","w","t"],"age":[23,34,23,34,45,]})

In [38]:
d1

   sid name  age
0  231    x   23
1  232    y   34
2  233    z   23
3  234    w   34
4  235    t   45

In [39]:
cricket=pd.DataFrame({"sid":[231,232,234,235,236,240],"player":pd.Categorical(["bats","boller","bats","allrounder","boller","bats"]),"perform":[2.3,3.4,5.3,6.4,4.5,7.3]})

In [40]:
cricket

   sid      player  perform
0  231        bats      2.3
1  232      boller      3.4
2  234        bats      5.3
3  235  allrounder      6.4
4  236      boller      4.5
5  240        bats      7.3

In [41]:
football=pd.DataFrame({"id":[231,235,233,240],"pos":["center","middle","left","right"]})

In [42]:
football

    id     pos
0  231  center
1  235  middle
2  233    left
3  240   right

In [43]:
c=pd.merge(d1,cricket,on="sid")

In [44]:
c

   sid name  age      player  perform
0  231    x   23        bats      2.3
1  232    y   34      boller      3.4
2  234    w   34        bats      5.3
3  235    t   45  allrounder      6.4

In [45]:
y=pd.merge(d1,cricket,on="sid",how="left")

In [46]:
y

   sid name  age      player  perform
0  231    x   23        bats      2.3
1  232    y   34      boller      3.4
2  233    z   23         NaN      NaN
3  234    w   34        bats      5.3
4  235    t   45  allrounder      6.4

In [47]:
y1=pd.merge(d1,cricket,on="sid",how="right")

In [48]:
y1

   sid name   age      player  perform
0  231    x  23.0        bats      2.3
1  232    y  34.0      boller      3.4
2  234    w  34.0        bats      5.3
3  235    t  45.0  allrounder      6.4
4  236  NaN   NaN      boller      4.5
5  240  NaN   NaN        bats      7.3

In [49]:
k=pd.merge(y,football,left_on="sid",right_on="id")

In [50]:
k

   sid name  age      player  perform   id     pos
0  231    x   23        bats      2.3  231  center
1  233    z   23         NaN      NaN  233    left
2  235    t   45  allrounder      6.4  235  middle

In [51]:
cricket.query("sid>233")

   sid      player  perform
2  234        bats      5.3
3  235  allrounder      6.4
4  236      boller      4.5
5  240        bats      7.3

In [52]:
cricket.query("sid>233 and perform<4.5")

Empty DataFrame
Columns: [sid, player, perform]
Index: []

In [ ]:
df.shape

In [ ]:
s=df.dropna()

In [ ]:
s.shape

In [ ]:
#df.groupby('YEAR').agg({'company'})

In [ ]:
f=df.groupby('YEAR')['YEAR'].count()

In [ ]:
f

In [ ]:
f.plot(kind="bar")
plt.show()

In [ ]:
#f.plot(kind="bar",colors=[""])
#plt.show()

In [ ]:
df.head()

In [ ]:
df['Status'].shape

In [ ]:
df['Status'].unique

In [ ]:
df['Status'].value_counts()

In [ ]:
b=df.groupby('YEAR')['Status'].value_counts()
b.plot(kind="bar")
plt.show()

In [46]:
import pandas as pd
s=pd.Series([2,3,4,5,"hello",3]) # if we enter a string in a integer series then its datatype will convert to string and we can't perform any operation like float

In [47]:
s

0        2
1        3
2        4
3        5
4    hello
5        3
dtype: object

In [48]:
type(s)

pandas.core.series.Series

In [44]:
import numpy as np
s=pd.Series([2,3,4,5,np.nan,3])

In [45]:
s

0    2.0
1    3.0
2    4.0
3    5.0
4    NaN
5    3.0
dtype: float64

In [6]:
df2

NameError: name 'df2' is not defined